#encoding:utf-8
try:
    a=int(input("请输入利润（万元）："))
except NameError:
    a="请重新输入"
except SyntaxError:
    a="请重新输入"

if a<0:
    print("利润不能是负数！")
elif a=="请重新输入":
    print("输入有误，请重新输入！")
elif  0<a<=10:
    print("发放的奖金是:%.3f万元"%(a*0.1))
elif a>10 and a<=20:
    print("发放的奖金是:%.3f万元"%(10*0.1+(a-10)*0.075))
elif a>20 and a<=40:
    print("发放的奖金是:%.3f万元"%(10*0.1+10*0.075+(a-20)*0.05))
elif a>40 and a<=60:
    print("发放的奖金是:%.3f万元"%(10*0.1+10*0.075+20*0.05+(a-40)*0.03))
elif a>60 and a<=100:
    print("发放的奖金是:%.3f万元"%(10*0.1+10*0.075+20*0.05+20*0.03+(a-60)*0.015))
else:
    print("发放的奖金是:%.3f万元"%(10*0.1+10*0.075+20*0.05+20*0.03+40*0.015+(a-100)*0.01))